'use strict'

const express = require('express');
const bodyParser = require('body-parser');
var request = require('request');
const app = express();
var encoding = require("encoding");



app.set('port', (process.env.PORT || 5000)) 
app.use(bodyParser.urlencoded({extended: false}))
app.use(bodyParser.json())

app.listen(app.get('port'), function() {
    console.log('running on port', app.get('port'))
})
var Token = process.env.TOKEN;
//var WebDF = process.env.WebDF;

var access_token = 'Bearer {'+Token+'}'
var name = "";

app.get('/', (req, res) => {
  res.end("ok")
})



app.post('/webhook', (req, res) => {

    var data = req.body; 
console.log('-----ปริ้นทั้งหมด-----' + JSON.stringify(data));
    
//console.log('++++'+JSON.stringify(req.body.events));
    
    var sende_r = req.body.events[0].source.userId
    var reToken = req.body.events[0].replyToken
    
    var data = req.body; 
    
    if (req.body.events[0].type == "message") { 
    if (req.body.events[0].message.type == "text") {
     
     var tex_t = req.body.events[0].message.text
     
        //profile(reToken, sende_r); 
     
     postToDialogflow(req);

     }
        
     }else if (req.body.events[0].type == "beacon") {  
     if (req.body.events[0].beacon.type == "enter") {   
        
     var beacon_id = req.body.events[0].beacon.hwid  
       //  if(beacon_1 == "0133a0751f"){
       //  profile(reToken, sende_r);    
       //  }else if(beacon_1 == "0133a0751f"){
       //  profile(reToken, sende_r);    
       //  } 
       profile(reToken, sende_r, beacon_id);  
       console.log("---enter---" + sende_r+"-------"+beacon_id);  
     }
 }
 
 
 })
 
 
 /////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////


function data_enter(sende_r, beacon_id) {


   var checktime = "https://script.google.com/macros/s/AKfycbxZ4_XfKROefcqvh1wzT0xvEu2_DW-jJ5RaG1JeAlPLN2MTXEc/exec?userId="+sende_r+"&beaconid="+beacon_id;
 request(checktime, function (error, response, body) {

})


}





// เช็คโปรไฟล์
/////////////////////////////////////////////////////////////////////////

function profile(reToken,sende_r, beacon_id) {

    var headers = {
       'Authorization' : access_token
}
    

var options = {
    url: 'https://api.line.me/v2/bot/profile/'+sende_r,
    method: 'GET',
    headers: headers,
    }

 request(options, function (error, response, body) {
    if (!error && response.statusCode == 200) {
        var info = JSON.parse(body);
        name = info.displayName;
        
          if(beacon_id == "0133a0751f"){
         var msg = {
           "type": "text",
           "text": "ขณะนี้คุณ"+" " +name +" " + "กำลังอยู่บริเวณประตู 1 (ด้านถนนวิทยุ) ของสวนลุมพินี" +
                    "\n"+
                    "\n\tหากคุณ"+" " +name +" " + "กำลังเดินทางเข้าเยี่ยมชมงาน เมื่อเดินตรงไปถึงทางแยก หากท่านเดินตรงไปจะพบกับซุ้มของหน่วยงานราชการต่าง ๆ  หากเลี้ยวซ้ายจะไปพบกับซุ้มอาหารมากมายจากทุกภาคทั่วประเทศไทย" +
                    "\n"+
                    "\n\tหากคุณ"+" " +name +" " + "กำลังเดินทางออกจากงาน ทางออกนี้จะนำท่านไปสู่ถนนวิทยุ หากขึ้นรถฝั่งนี้สามารถเดินทางไปถนนสุขุมวิทได้ หรือสถานีรถไฟฟ้าเพลินจิต หากต้องการขึ้นรถประจำทางเมื่อเดินออกจากประตูให้เดินไปทางขวา หากท่านข้ามสะพานลอยไปขึ้นรถอีกฝั่งสามารถเดินทางไปยังถนนพระราม 4 และสถานีรถไฟฟ้าใต้ดินลุมพินีได้" +
                    "\n"+ 
                     "\nข้อควรระวัง เนื่องจากมีผู้เข้าเยี่ยมชมงานเป็นจำนวนมาก อาจมีมิจฉาชีพแฝงตัวมาก่อเหตุล้วงกระเป๋า ขอให้ท่านโปรดระวังทรัพย์สินของท่านให้รัดกุมมากยิ่งขึ้น แนะนำให้ท่านสะพายกระเป๋าไว้ด้านหน้าของท่านตลอดเวลา หากท่านได้รับข้อความการแจ้งเตือนนี้บ่อยเกินไป สามารถหยุดรับข้อความได้ชั่วคราวด้วยการตั้งค่า ปิดการรับสัญญาณบลูทูธ ในโทรศัพท์มือถือของท่านได้ทันที" +
                    "\n"+ 
                    "\nด้วยความปราถนาดี"+ 
                    "\nจาก พ.ต.อ.กัมพล รัตนประทีป"+ 
                    "\nผู้กำกับการ สถานีตำรวจนครบาลลุมพินี"

          }; 
        reply(reToken, msg, sende_r, beacon_id);    
         }else if(beacon_id == "0133a097a3"){
         var msg = {
           "type": "text",
           "text": "ขณะนี้คุณ"+" " +name +" " + "กำลังอยู่บริเวณประตู 2 (ด้านถนนวิทยุ) ของสวนลุมพินี" +
                    "\n"+
                    "\n\tหากคุณ"+" " +name +" " + "กำลังเดินทางเข้าเยี่ยมชมงาน เมื่อเดินตรงไปถึงทางแยก หากท่านเดินตรงไปหรือเลี้ยวซ้ายท่านกำลังมุ่งหน้าไปยังซุ้มของสมาคม ชมรม สโมสรและองค์กรทั่วไป หากท่านเลี้ยวขวาท่านจะพบกับซุ้มอาหารมากมายจากทุกภาคทั่วประเทศไทย เดินตรงไปจะพบกับซุ้มของหน่วยงานราชการต่าง ๆ" +
                    "\n"+
                    "\n\tหากคุณ"+" " +name +" " + "กำลังเดินทางออกจากงาน ทางออกนี้จะนำท่านไปสู่ถนนวิทยุ หากขึ้นรถฝั่งนี้สามารถเดินทางไปถนนสุขุมวิทได้ หรือสถานีรถไฟฟ้าเพลินจิต หากต้องการขึ้นรถประจำทางเมื่อเดินออกจากประตูให้เดินไปทางซ้าย หากท่านข้ามถนนไปยังโครงการ One Bangkok ท่านสามารถไปยังสถานีรถไฟฟ้าใต้ดินลุมพินีได้" +
                    "\n"+ 
                     "\nข้อควรระวัง เนื่องจากมีผู้เข้าเยี่ยมชมงานเป็นจำนวนมาก อาจมีมิจฉาชีพแฝงตัวมาก่อเหตุล้วงกระเป๋า ขอให้ท่านโปรดระวังทรัพย์สินของท่านให้รัดกุมมากยิ่งขึ้น แนะนำให้ท่านสะพายกระเป๋าไว้ด้านหน้าของท่านตลอดเวลา หากท่านได้รับข้อความการแจ้งเตือนนี้บ่อยเกินไป สามารถหยุดรับข้อความได้ชั่วคราวด้วยการตั้งค่า ปิดการรับสัญญาณบลูทูธ ในโทรศัพท์มือถือของท่านได้ทันที" +
                    "\n"+ 
                    "\nด้วยความปราถนาดี"+ 
                    "\nจาก พ.ต.อ.กัมพล รัตนประทีป"+ 
                    "\nผู้กำกับการ สถานีตำรวจนครบาลลุมพินี"
          }; 
        reply(reToken, msg, sende_r, beacon_id);   
         }
         
        else if(beacon_id == "01344237f6"){
         var msg = {
           "type": "text",
           "text": "ขณะนี้คุณ"+" " +name +" " + "กำลังอยู่บริเวณประตู 3 (ด้านถนนพระราม 4) ของสวนลุมพินี" +
                    "\n"+
                    "\n\tหากคุณ"+" " +name +" " + "กำลังเดินทางเข้าเยี่ยมชมงาน เมื่อเดินตรงไปถึงทางแยก หากท่านเดินตรงไปท่านจะพบกับกองอำนวยการจัดงานกาชาดซึ่งท่านสามารถแจ้งเหตุต่าง ๆ และสอบถามข้อมูลเกี่ยวกับงานกาชาดได้ หากท่านเลี้ยวซ้าย ท่านจะพบกับซุ้มของหน่วยงานของความมั่นคง รักษาความปลอดภัย และสมาคมแม่บ้าน หากท่านเลี้ยวขวา ท่านจะพบกับซุ้มของสมาคม ชมรม สโมสรและองค์กรทั่วไป" +
                    "\n"+
                    "\n\tหากคุณ"+" " +name +" " + "กำลังเดินทางออกจากงาน ทางออกนี้จะนำท่านไปสู่ถนนพระราม 4  หากขึ้นรถฝั่งนี้สามารถเดินทางไปถนนวิทยุ และสาทรใต้ นอกจากนั้นท่านยังสามารถไปสถานีรถไฟฟ้าเพลินจิตได้ หากต้องการขึ้นรถประจำทางเมื่อเดินออกจากประตูให้เดินไปทางซ้าย" +
                    "\n"+ 
                     "\nข้อควรระวัง เนื่องจากมีผู้เข้าเยี่ยมชมงานเป็นจำนวนมาก อาจมีมิจฉาชีพแฝงตัวมาก่อเหตุล้วงกระเป๋า ขอให้ท่านโปรดระวังทรัพย์สินของท่านให้รัดกุมมากยิ่งขึ้น แนะนำให้ท่านสะพายกระเป๋าไว้ด้านหน้าของท่านตลอดเวลา หากท่านได้รับข้อความการแจ้งเตือนนี้บ่อยเกินไป สามารถหยุดรับข้อความได้ชั่วคราวด้วยการตั้งค่า ปิดการรับสัญญาณบลูทูธ ในโทรศัพท์มือถือของท่านได้ทันที" +
                    "\n"+ 
                    "\nด้วยความปราถนาดี"+ 
                    "\nจาก พ.ต.อ.กัมพล รัตนประทีป"+ 
                    "\nผู้กำกับการ สถานีตำรวจนครบาลลุมพินี"
          }; 
        reply(reToken, msg, sende_r, beacon_id);   
         }
        else if(beacon_id == "013446ebd9"){
         var msg = {
           "type": "text",
           "text": "ขณะนี้คุณ"+" " +name +" " + "กำลังอยู่บริเวณประตู 4 (ด้านอนุเสาวรีย์รัชกาลที่ 6) ของสวนลุมพินี" +
                    "\n"+
                    "\n\tหากคุณ"+" " +name +" " + "กำลังเดินทางเข้าเยี่ยมชมงาน เมื่อเดินตรงไปถึงทางแยก หากท่านเดินตรงไปท่านจะพบกับซุ้มของหน่วยงานของความมั่นคง รักษาความปลอดภัย และสมาคมแม่บ้าน ทางด้านขวามือของท่าน หากท่านเลี้ยวซ้าย ท่านจะพบกับห้องน้ำเคลื่อนที่ หากท่านเลี้ยวขวา ท่านสามารถมุ่งหน้าสู่กองอำนวยการจัดงานกาชาดซึ่งท่านสามารถแจ้งเหตุต่าง ๆ และสอบถามข้อมูลเกี่ยวกับงานกาชาดได้" +
                    "\n"+
                    "\n\tหากคุณ"+" " +name +" " + "กำลังเดินทางออกจากงาน หากท่านมุ่งหน้าไปทางซ้ายท่านจะพบกับรถไฟฟ้าใต้ดินสถานีสีลม และถนนพระราม 4  หากขึ้นรถฝั่งนี้สามารถเดินทางไปถนนถนนวิทยุ และสาทรใต้ หากท่านมุ่งหน้าไปทางขวา ท่านจะพบกับถนนราชดำริ หากขึ้นรถฝั่งนี้สามารถเดินทางไปถนนสีลมและสถานีรถไฟฟ้าศาลาแดง ได้  หากท่านข้ามถนนไปแล้วท่านจะพบกับโรงพยาบาลจุฬาฯ หากท่านขึ้นรถฝั่งนี้ท่านสามารถเดินทางไปยังสถานีรถไฟฟ้าราชดำริ ห้างสรรพสินค้าเซ็นทรัลเวิลด์ และ ประตูน้ำได้" +
                    "\n"+ 
                     "\nข้อควรระวัง เนื่องจากมีผู้เข้าเยี่ยมชมงานเป็นจำนวนมาก อาจมีมิจฉาชีพแฝงตัวมาก่อเหตุล้วงกระเป๋า ขอให้ท่านโปรดระวังทรัพย์สินของท่านให้รัดกุมมากยิ่งขึ้น แนะนำให้ท่านสะพายกระเป๋าไว้ด้านหน้าของท่านตลอดเวลา หากท่านได้รับข้อความการแจ้งเตือนนี้บ่อยเกินไป สามารถหยุดรับข้อความได้ชั่วคราวด้วยการตั้งค่า ปิดการรับสัญญาณบลูทูธ ในโทรศัพท์มือถือของท่านได้ทันที" +
                    "\n"+ 
                    "\nด้วยความปราถนาดี"+ 
                    "\nจาก พ.ต.อ.กัมพล รัตนประทีป"+ 
                    "\nผู้กำกับการ สถานีตำรวจนครบาลลุมพินี"
          }; 
        reply(reToken, msg, sende_r, beacon_id);   
         }
        else if(beacon_id == "013448341c"){
         var msg = {
           "type": "text",
           "text": "ขณะนี้คุณ"+" " +name +" " + "กำลังอยู่บริเวณประตู 5 (ด้านตรงข้าม รพ.จุฬาลงกรณ์) ของสวนลุมพินี" +
                    "\n"+
                    "\n\tหากคุณ"+" " +name +" " + "กำลังเดินทางเข้าเยี่ยมชมงาน เมื่อเดินตรงไปถึงทางแยก หากท่านเลี้ยวซ้าย และเดินต่อไปตามเส้นทางท่านจะพบกับซุ้มของหน่วยงานราชการต่าง ๆ หากท่านเลี้ยวขวา ท่านกำลังมุ่งหน้าสู่ พระบรมราชานุสาวรีย์ รัชกาลที่ 6 และท่านสามารถเดินทางไปบริเวณซุ้มของหน่วยงานความมั่นคง รักษาความปลอดภัย และสมาคมแม่บ้านได้" +
                    "\n"+
                    "\n\tหากคุณ"+" " +name +" " + "กำลังเดินทางออกจากงาน ท่านจะพบกับถนนราชดำริ ซึ่งหากท่านขึ้นรถจากฝั่งนี้ ท่านสามารถมุ่งหน้าไปยังถนนสีลม โรงพยาบาลจุฬาลงกรณ์  “สถานีรถไฟฟ้าใต้ดินสีลม” และ “สถานีรถไฟฟ้าศาลาแดง” ได้ หากท่านข้ามถนนไปฝั่งตรงข้าม ท่านสามารถขึ้นรถและเดินทางไปยัง “สถานีรถไฟฟ้าราชดำริ” ห้างสรรพสินค้าเซ็นทรัลเวิลด์ สยาม และประตูน้ำได้" +
                    "\n"+ 
                     "\nข้อควรระวัง เนื่องจากมีผู้เข้าเยี่ยมชมงานเป็นจำนวนมาก อาจมีมิจฉาชีพแฝงตัวมาก่อเหตุล้วงกระเป๋า ขอให้ท่านโปรดระวังทรัพย์สินของท่านให้รัดกุมมากยิ่งขึ้น แนะนำให้ท่านสะพายกระเป๋าไว้ด้านหน้าของท่านตลอดเวลา หากท่านได้รับข้อความการแจ้งเตือนนี้บ่อยเกินไป สามารถหยุดรับข้อความได้ชั่วคราวด้วยการตั้งค่า ปิดการรับสัญญาณบลูทูธ ในโทรศัพท์มือถือของท่านได้ทันที" +
                    "\n"+ 
                    "\nด้วยความปราถนาดี"+ 
                    "\nจาก พ.ต.อ.กัมพล รัตนประทีป"+ 
                    "\nผู้กำกับการ สถานีตำรวจนครบาลลุมพินี"
          }; 
        reply(reToken, msg, sende_r, beacon_id);   
         }
        else if(beacon_id == "01344ad82f"){
         var msg = {
           "type": "text",
           "text": "ขณะนี้คุณ"+" " +name +" " + "กำลังอยู่บริเวณประตู 6 (ด้านถนนสารสิน) ของสวนลุมพินี" +
                    "\n"+
                    "\n\tหากคุณ"+" " +name +" " + "กำลังเดินทางเข้าเยี่ยมชมงาน เมื่อเดินตรงไปถึงทางแยก หากท่านเลี้ยวซ้าย และเดินต่อไปตามเส้นทางท่านจะพบกับซุ้มของหน่วยงานราชการต่าง ๆ" +
                    "\n"+
                    "\n\tหากคุณ"+" " +name +" " + "กำลังเดินทางออกจากงาน ท่านจะพบกับถนนสารสิน ซึ่งหากท่านขึ้นรถจากฝั่งนี้ ท่านสามารถมุ่งหน้าไปยังถนนราชดำริ เมื่อถึงแยกถนนสารสิน-ราชดำริ หากท่านเลี้ยวซ้ายท่านสามารถเดินทางไปยัง โรงพยาบาลจุฬาลงกรณ์  “สถานีรถไฟฟ้าใต้ดินสีลม” และ “สถานีรถไฟฟ้าศาลาแดง” ได้ เมื่อถึงแยกถนนสารสิน-ราชดำริ หากท่านเลี้ยวขวาท่านสามารถเดินทางไปยัง“สถานีรถไฟฟ้าราชดำริ” ห้างสรรพสินค้าเซ็นทรัลเวิลด์ สยาม และประตูน้ำได้ หากท่านข้ามถนนไปฝั่งตรงข้าม ท่านสามารถขึ้นรถและเดินทางไปยัง ถนนวิทยุ และแยกเพลินจิตได้" +
                    "\n"+ 
                     "\nข้อควรระวัง เนื่องจากมีผู้เข้าเยี่ยมชมงานเป็นจำนวนมาก อาจมีมิจฉาชีพแฝงตัวมาก่อเหตุล้วงกระเป๋า ขอให้ท่านโปรดระวังทรัพย์สินของท่านให้รัดกุมมากยิ่งขึ้น แนะนำให้ท่านสะพายกระเป๋าไว้ด้านหน้าของท่านตลอดเวลา หากท่านได้รับข้อความการแจ้งเตือนนี้บ่อยเกินไป สามารถหยุดรับข้อความได้ชั่วคราวด้วยการตั้งค่า ปิดการรับสัญญาณบลูทูธ ในโทรศัพท์มือถือของท่านได้ทันที" +
                    "\n"+ 
                    "\nด้วยความปราถนาดี"+ 
                    "\nจาก พ.ต.อ.กัมพล รัตนประทีป"+ 
                    "\nผู้กำกับการ สถานีตำรวจนครบาลลุมพินี"
          }; 
        reply(reToken, msg, sende_r, beacon_id);   
         }
        else if(beacon_id == "01344c9149"){
         var msg = {
           "type": "text",
           "text": "ระบบได้บันทึกข้อมูลของคุณ "+ name + "\nเรียบร้อยแล้ว\n Beacon 7"
          }; 
        reply(reToken, msg, sende_r, beacon_id);   
         }
        else if(beacon_id == "01344cdece"){
         var msg = {
           "type": "text",
           "text": "ระบบได้บันทึกข้อมูลของคุณ "+ name + "\nเรียบร้อยแล้ว\n Beacon 8"
          }; 
        reply(reToken, msg, sende_r, beacon_id);   
         }
        else if(beacon_id == "01344dc086"){
         var msg = {
           "type": "text",
           "text": "ระบบได้บันทึกข้อมูลของคุณ "+ name + "\nเรียบร้อยแล้ว\n Beacon 9"
          }; 
        reply(reToken, msg, sende_r, beacon_id);   
         }
        else if(beacon_id == "01344eddf8"){
         var msg = {
           "type": "text",
           "text": "ระบบได้บันทึกข้อมูลของคุณ "+ name + "\nเรียบร้อยแล้ว\n Beacon 10"
          }; 
        reply(reToken, msg, sende_r, beacon_id);   
         }
        
        
        
    }
 })


}

//////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////


function reply(reToken, msg, sende_r, beacon_id) {
    let headers = {
        'Content-Type': 'application/json',
        'Authorization': access_token
    }
    let body = JSON.stringify({
        replyToken: reToken,
        messages: [msg]
    })
    request.post({
        url: 'https://api.line.me/v2/bot/message/reply',
        headers: headers,
        body: body
    }
)
    console.log("---data_enter---" + sende_r+"-------"+beacon_id);
data_enter(sende_r, beacon_id);
}

const postToDialogflow = req => {
    
  var WebDF = "https://bots.dialogflow.com/line/9c6a1598-acdd-4693-929d-29ccb36a541f/webhook";
  req.headers.host = "bots.dialogflow.com";
  return request({
    method: "POST",
    uri: WebDF ,
    headers: req.headers,
    body: JSON.stringify(req.body)
    
  });
 
};

